turjasuzworld/publib/TW_ESP8266_v3.c
                 UCA0BR0 = val2 % 256;                              // (see User's Guide)
                 UCA0BR1 = val2 / 256;                              //
                 UCA0MCTL |= UCBRS_7;
                 val3 = (val - val2)*8;
                 val4 = (int)(val3);
                 switch (val4)
                 {
                    case 0:
                        UCA0MCTL |= UCBRS_0 + UCBRF_0;            // Modulation UCBRSx=1, UCBRFx=0
                        break;
                    case 1:
                        UCA0MCTL |= UCBRS_1 + UCBRF_0;            // Modulation UCBRSx=1, UCBRFx=0
                        break;
                    case 2:
                        UCA0MCTL |= UCBRS_2 + UCBRF_0;            // Modulation UCBRSx=1, UCBRFx=0
                        break;
                    case 3:
                        UCA0MCTL |= UCBRS_3 + UCBRF_0;            // Modulation UCBRSx=1, UCBRFx=0
                        break;
                    case 4:
                        UCA0MCTL |= UCBRS_4 + UCBRF_0;            // Modulation UCBRSx=1, UCBRFx=0
                        break;
                    case 5:
                        UCA0MCTL |= UCBRS_5 + UCBRF_0;            // Modulation UCBRSx=1, UCBRFx=0
                        break;
                    case 6:
                        UCA0MCTL |= UCBRS_6 + UCBRF_0;            // Modulation UCBRSx=1, UCBRFx=0
                        break;
                    case 7:
                        UCA0MCTL |= UCBRS_7 + UCBRF_0;            // Modulation UCBRSx=1, UCBRFx=0
                        break;
                    default:
                        break;
                }
     }
     else
     {
         UCA0MCTL |= UCOS16;
         UCA0BR0 = ((uint16_t)(val/16))%256;
         UCA0BR1 = ((uint16_t)(val/16))/256;
         val3 = (val/16 - (uint16_t)(val/16))*16;
         val4 = (uint16_t)(val3);

         switch (val4)
         {
            case 1:
                UCA0MCTL |= UCBRF_1;
                break;
            case 2:
                UCA0MCTL |= UCBRF_2;
                break;
            case 3:
                UCA0MCTL |= UCBRF_3;
                break;
            case 4:
                UCA0MCTL |= UCBRF_4;
                break;
            case 5:
                UCA0MCTL |= UCBRF_5;
                break;
            case 6:
                UCA0MCTL |= UCBRF_6;
                break;
            case 7:
                UCA0MCTL |= UCBRF_7;
                break;
            case 8:
                UCA0MCTL |= UCBRF_8;
                break;
            case 9:
                UCA0MCTL |= UCBRF_9;
                break;
            case 10:
                UCA0MCTL |= UCBRF_10;
                break;
            case 11:
                UCA0MCTL |= UCBRF_11;
                break;
            case 12:
                UCA0MCTL |= UCBRF_12;
                break;
            case 13:
                UCA0MCTL |= UCBRF_13;
                break;
            case 14:
                UCA0MCTL |= UCBRF_14;
                break;
            case 15:
                UCA0MCTL |= UCBRF_15;
                break;
            default:
                break;
        }


     }


     UCA0CTL1 &= ~UCSWRST;                     // **Initialize USCI state machine**
     switch (interrupt_polling)
     {
        case 1:
            UCA0IE |= UCRXIE;                         // Enable USCI_A0 RX interrupt
            __bis_SR_register(GIE);       // Enter LPM0, interrupts enabled
            break;
        case 2:
             UCA0IE &= ~(UCRXIE + UCTXIE);                         // Enable USCI_A0 RX interrupt
             break;
        default:
            break;
    }

     return 0;
}


/*
 *  Reset the buffer counter
 */
void    ClrEspBuff(void)
{
    if(_MdmBuffCnt>0)
        {
            unsigned int var;
            for (var = 0; var < _MdmBuffCnt; ++var)
            {
                _MdmBuffer[var]='\0';
            }
            _MdmBuffCnt = 0;
        }
}


/*
 *  Send String of data to modem by calling this Fn.
 */
void     SendDataToESP(const char* data)
{
//    uint8_t indx=0;

        ClrEspBuff();
        while(*data)
        {
            while (!(UCA0IFG&UCTXIFG));             // USCI_A0 TX buffer ready?
            UCA0TXBUF = *data;                  // TX -> RXed character
                SendCharToUCA3(*data);
            data++;
        }



}

/*
 *  Send single character data to modem
 */
void      SendCharToESP(unsigned char data)
{
        while (!(UCA0IFG&UCTXIFG));             // USCI_A0 TX buffer ready?
        UCA0TXBUF = data;                  // TX -> RXed character
            SendCharToUCA3(data);
        _delay_cycles(SystemFreq/100);

}

/*
 *  Disable the Long Response and Echo,
 *  Condition is saved in _MdmInitSts
 */
void    DeEchoShrtRsp(void)
{

}


/*
 *  Initializes the Modem and checks the status of init. Also
 *  Checks for the diagnostics and saves required values
 *  to an Array through a return Pointer to an Array
 *  OutPut Array Format = {
 *  ICCID[20] //+CCID: “898600220909A0206023898600220909A0206023”
 *  COPS[] //+COPS: 0,0,"Vodafone - Delhi"
 *  QINISTAT[1] //+QINISTAT: 3
 *  QLTS[]      //+QLTS: "19/07/06,17:26:27+22,0" --> ONLY ONCE ALLOWED IMMEDIATELY AFTER POWER UP & NEEDS AT+CTZU=3
 *  CREG[]      //+CREG: 0,5
 *  CSQ[]       //+CSQ: 31,0
 *  CBC[]       //+CBC: 0,82,3955
 *
 *  _MdmStatus[0-19:ICCID][20-22:0,2/0,5 CREG][OPERATER]
 *
 *  ///////////////////////
 *  STATE MACHINES
 *  //////////////////////
 *   POWER ON -> UNECHO SHRT RESPNSE -> SET NTWRK TIME SYNC -> CHK NTWRK REG -> CHECK NTWRK PWR -> CHK MODULE SUPPLY VOLTAGE-->EXIT
 *   /////////////////////
 *   example:
 *   _MdmStatus[70]=[iccid 0-19][;][netwrg status 20-22][;][operator name 23-?][;][RSSI ? +2][;][network time GMT + time zone ?+21][;][cbc mode ? +7][;]
 *   _MdmStatus[70]=[12231092012343127901][;][0,5][;][Vodafone - Delhi][;][31][;][19/07/13,08:09:53,+22][;][,03,3960]
 */

esp8266StateMachines    _ReadEspRSSI(char* apName, char* rssiHolder)
{
    esp8266StateMachines RetSts;
    volatile char* res = NULL;
    ///////////// Network Strength Fetch ////////////
    static int RetryTimeout = 2;
    do
    {
        SendDataToESP("AT+CWLAP\r\n");

        _delay_cycles(SystemFreq);
        res = NULL;

        res = mdmReplySearch((const char *)_MdmBuffer, "OK");
        if(res == "Timeout") return _E8266_RSSI_RCV_TIMEOUT;

        if(*res == 'O')
        {
            RetSts = _E8266_RSSI_RCV_SUCCESS;
        }

        RetryTimeout--;

