turjasuzworld/publib/TW_ESP8266_v3.c
    } while((RetSts != _E8266_RSSI_RCV_SUCCESS)&&(RetryTimeout>0));

    if(RetSts == _E8266_RSSI_RCV_SUCCESS)
    {
        temp_mdm = strstr((const char*)_MdmBuffer, (const char*)apName);
        temp_mdm+= strlen((const char*)apName);
        temp_mdm += 2;
        rssiHolder[0] = 0; // completely clear previous values to null
        rssiHolder[1] = 0;
        rssiHolder[2] = 0;
        int Charcount= 0; // DONT USE THIS BECAUSE WE DON'T\KNOW HOW MANY CHARS WILL COOME IN COPS
        while(*temp_mdm != ',')
        {

            rssiHolder[Charcount]= *temp_mdm;
            temp_mdm++;
            Charcount++;
        }

    }

    return RetSts;
}


/*
 *  Get the IP Address of the instance
 */

int            ReadIPAddr(void)
{
    // useless Fxn
    return 0;
}

/*
 *  Disable the ESP8266 Module
 */
void            disESP8266(void)
{
    _ESP_EN_PORT_OUT &= ~_ESP_EN;
}

/*
 *  Enable the ESP8266 Module
 */
void            enESP8266(void)
{
    _ESP_EN_PORT_OUT |= _ESP_EN;
}



esp8266StateMachines    MdmMakeReady(espOperCommand OperCmd, esp8266StateMachines currState, char* _getUrlPtr, char* _servUrlPtr, char* _udpServUrlPtr,char* _setUrlPtr,int _udpServPort, int _udpDataLen) // currState will be verified everytime
{
    /*                  === GET EXAMPLE =====
     *

     */
    volatile                     esp8266StateMachines RetSts =  currState; //_E8266_PWR_UP;
    static volatile int          RetryTimeout1=0, RetryTimeout2=0,RetryTimeout3=0,RetryTimeout4=0,RetryTimeout5=0;
    volatile int Charcount=0, res_type = 0;
    static int apiLength=0, apnValidation=0, temp_count=0, waitCount = 0;
    volatile char* res = NULL;
    static  unsigned int   ctr=0, udpDataCtr = 0;
///////////// Initialization Switch Cases////////////////////
    switch (OperCmd)
    {
            case _Esp_Full_Init:
                SendDataToUCA3("__case _Esp_Full_Init in MdmMakeReady__\r");
                _ESP_EN_PORT_DIR |= _ESP_EN;
                _ESP_RST_PORT_DIR |= _ESP_RST;

                if((RetSts == _E8266_PWR_UP)||(RetSts == _E8266_PWR_RESTART))
                {
                    _ESP_RST_PORT_OUT &= ~_ESP_RST;
                    _delay_cycles(SystemFreq);
                    _ESP_RST_PORT_OUT |= _ESP_RST;
                    _delay_cycles(SystemFreq*5);

                    SendDataToESP("AT\r\n");
                    if (mdmReplySearch((const char*)_MdmBuffer, "OK")=="Timeout") RetSts = _E8266_PWR_UP_FAILURE;
                    else RetSts = _E8266_PWR_UP_SUCCESS;
                }
                else if(RetSts == _E8266_PWR_DN)
                {
                    _ESP_RST_PORT_OUT &= ~_ESP_RST;
                    SendDataToESP("AT\r\n");
                    if (mdmReplySearch((const char*)_MdmBuffer, "OK")=="Timeout") RetSts = _E8266_PWR_OFF;
                    else RetSts = _E8266_UNKNOWN_FAILURE;
                }
                else if(RetSts == _E8266_PWR_RESTART_DELAY)
                {
                    _ESP_RST_PORT_OUT &= ~_ESP_RST;
                    _delay_cycles(SystemFreq*5);
                    _ESP_RST_PORT_OUT |= _ESP_RST;
                    _delay_cycles(SystemFreq*5);

                    SendDataToESP("AT\r\n");
                    if (mdmReplySearch((const char*)_MdmBuffer, "OK")=="Timeout") RetSts = _E8266_PWR_UP_FAILURE;
                    else RetSts = _E8266_PWR_UP_SUCCESS;
                }
                else
                {

                }

                break;


        case _Esp_Connect_WIFI:
             RetSts = currState;
             if((RetSts == _E8266_PWR_UP_SUCCESS)||(RetSts == _E8266_RST_SUCCESS)||(RetSts == _E8266_DeECHO_SUCCESS))
             {
                 ///////////// send CWMODE = 1  _E8266_STN_MODE_FAIL /  _E8266_STN_MODE_SUCCESS, ////////////
                 RetryTimeout1 = 5;
                 do
                 {
                     SendDataToESP("AT+CWMODE_CUR=1\r\n"); // station mode set
                     //_delay_cycles(SystemFreq*3);
/*
                     res = NULL;
                     do
                     {
                         res = mdmReplySearch((const char *)_MdmBuffer, "OK");
                         res = mdmReplySearch((const char *)_MdmBuffer, "FAIL");
//                         res = strstr((const char *)_MdmBuffer,"AT+CWMODE_CUR=1"); //===> error detected here. cannot compare like this as the
                                                                                     //buffer is filled with other value that remoes the condition of res==NULL
                         _delay_cycles(SystemFreq/5);

                     } while (res == NULL); // Blocking Call
*/
                     RetryTimeout2 = 30;
                     do
                     {
                         _delay_cycles(SystemFreq/5);
                         res = NULL;
                         res = strstr((const char *)_MdmBuffer,"FAIL");
                         _delay_cycles(SystemFreq/5);
                         if(*res == 'F')
                         {

                             break;
                         }
                         res = strstr((const char *)_MdmBuffer,"OK");
                         _delay_cycles(SystemFreq/5);
                         if(*res == 'O')
                         {

                             break;
                         }
                         RetryTimeout2--;
                     } while ((res == NULL)&&(RetryTimeout2>0));

                     if(*res=='O')
                     {
                         res_type = 0; // 0 = success
                         RetSts = _E8266_STN_MODE_SUCCESS;
                     }
                     else if(*res=='F')
                     {
                         res_type = -1; // -1 = fail
                         RetSts = _E8266_STN_MODE_FAIL;
                     }

                     RetryTimeout1--;

                 } while((RetSts != _E8266_STN_MODE_SUCCESS)&&(RetryTimeout1>0));

                 if (RetryTimeout1 == 0)
                  {
                     RetSts = _E8266_STN_MODE_FAIL;
                  }

                 /////////// Next connect to WIFI Network (this should be fetched from LCD///////////
                 if(RetSts == _E8266_STN_MODE_SUCCESS)
                              {

                                  RetryTimeout1 = 3;
                                  do
                                  {
                                      SendDataToESP("AT+CWJAP_CUR=\"");
                                      SendDataToESP((const char*)WifiParams._wifiSSID);
                                      SendDataToESP("\",\"");
                                      SendDataToESP((const char*)WifiParams._wifiPSWD);
                                      SendDataToESP("\"\r\n"); // later ssid and psswd will be fetched from LCD
                                      _delay_cycles(SystemFreq*3);
                                      RetryTimeout5 = 20;
                                      do
                                      {
                                          //res = strstr((const char *)_MdmBuffer,"OK");
                                          __delay_cycles(SystemFreq);
                                          res = NULL;
                                          res = strstr((const char *)_MdmBuffer,"OK");
                                          if(*res == 'O')
                                          {
                                              break;
                                          }
                                          res = NULL;
                                          res = strstr((const char *)_MdmBuffer,"FAIL");
                                          if(*res == 'F')
                                          {
                                              break;
                                          }
                                          RetryTimeout5 --;
                                      } while (RetryTimeout5>0); // no more Blocking Call
                                      if(res!=NULL)
                                      {
                                          if((*res)=='F')
                                          {
                                              res = NULL;
                                              res = strstr((const char *)_MdmBuffer,"CWJAP:");
                                              res = res + 6;// point to <error code> in +CWJAP_CUR:<error code>
                                              if(*res == '1')
                                                  {
                                                      RetSts = _E8266_CWJAP_CON_TIMOUT_1;
                                                  }
                                              else if(*res == '2')
                                                  {
                                                      RetSts = _E8266_CWJAP_WRNG_PSWRD_2;
                                                  }
                                              else if(*res == '3')
                                                  {
                                                      RetSts = _E8266_CWJAP_AP_NT_FND_3;
                                                  }
                                              else if(*res == '4')
                                                  {
                                                      RetSts = _E8266_CWJAP_CON_GENERAL_FAIL_4;
                                                  }
                                              else
                                                  {
                                                      RetSts = _E8266_CWJAP_UNKNWN_FAIL;
                                                  }

