turjasuzworld/publib/TW_ESP8266_v3.c
                                          }
                                          else if((*res)=='O')
                                          {
                                              RetSts = _E8266_WIFI_CONCTD_SUCCESS;
                                              res = NULL;
                                              do
                                              {
                                                  res = strstr((const char *)_MdmBuffer,"WIFI GOT IP");
                                              } while (res == NULL); // Blocking Call

                                              if(res!=NULL)
                                              {
                                                  RetSts = _E8266_WIFI_RCV_IP_SUCCESS;
                                              }
                                          }

                                      }
                                      else
                                      {
                                          // no handling reqd.
                                      }



                                      RetryTimeout1--;

                                  } while((RetSts != _E8266_WIFI_RCV_IP_SUCCESS)&&(RetryTimeout1>0));

                                  if (RetryTimeout1 == 0)
                                   {
                                      //return the RetSts received

                                   }
                              }

                 ////////////Ping and check Internet availability ////////////////////////////
                 if(RetSts == _E8266_WIFI_RCV_IP_SUCCESS)
                 {
                     RetryTimeout1 = 2;
                     do
                     {
                         SendDataToESP("AT+CIFSR\r\n");

                         res = NULL;
                         res = mdmReplySearch((const char *)_MdmBuffer, "\""); //+CIFSR:STAIP,"192.168.1.7"<\r><\n>

                         res += 1; // points to the first number of the IP
                         temp_count = 0;
                         while(*res != '"')
                         {

                             WifiParams._wifiIPAddr[temp_count] = *res;
                             //_MdmIPAddr[temp_count] = *res;
                             temp_count++;
                             res++;
                         }
                         _delay_cycles(SystemFreq/5);

                         waitCount = 5;
                         SendDataToESP("AT+PING=\"www.turjasuzworld.online\"\r\n");
                         _delay_cycles(SystemFreq);

                         do
                         {
                             res = NULL;
                             res = strstr((const char *)_MdmBuffer,"OK");
                             _delay_cycles(SystemFreq/2);
                             if(*res == 'O')
                             {
                                 break;
                             }
                             res = NULL;
                             res = strstr((const char *)_MdmBuffer,"ERROR");
                             _delay_cycles(SystemFreq/2);
                             if(*res == 'E')
                             {
                                 break;
                             }
                             waitCount --;
                         } while ((res == NULL)&&(waitCount>0)); // Blocking Call but implemented timeout
                         if(*res == 'O')
                         {
                                 ctr = 0;
                             while(*res != '+') res--;      // search for the previous + sign
                             res++;
                             while((*res != '\r')&&(ctr<sizeof(WifiParams._wifiInetPingMs)))
                             {
                                 WifiParams._wifiInetPingMs[ctr]=*res;
                                 ctr++;
                                 res++;
                             }
                             RetSts = _E8266_PING_SUCCESS;
                         }
                         else if(*res == 'E')
                         {
                             WifiParams._wifiInetPingMs[0]='n';
                             WifiParams._wifiInetPingMs[1]='o';
                             WifiParams._wifiInetPingMs[2]='I';
                             WifiParams._wifiInetPingMs[3]='N';
                             RetSts = _E8266_PING_FAIL;
                         }
                         RetryTimeout1--;
                     } while((RetSts != _E8266_PING_SUCCESS)&&(RetSts != _E8266_PING_FAIL)&&(RetryTimeout1>0));

                     if (RetryTimeout1 == 0)
                     {
                         RetSts = _E8266_PING_TIMEOUT;
                     }
                 }

             }
             else
             {
                 // No handling reqd. the last status will be returned
             }


            break;



        case _Esp_disConnect_WIFI:
            // use case not needed
            break;




        case _Esp__repeated_send_Request:
            SendDataToUCA3("__case _Esp__repeated_send_Request in MdmMakeReady__\r");
//            runHomeDisplay(_UpdateTxDataTransaction);
            RetSts = currState;
            if((RetSts == _E8266_CIPSTART_ALREADY_CONNCTD)||(RetSts == _E8266_CIPSTART_UDP_OK)||(RetSts == _E8266_CIPSTART_OK)||(RetSts == _E8266_SEND_OK_RECVD)||(RetSts == _E8266_SEND_TIMEOUT))
            {
                 RetryTimeout1 = 5;
                 do
                 {
                     SendDataToESP("AT+CIPSEND="); // station mode set
                     /*
                      * Check if UDP or TCP needed
                      * Send length accordingly
                      */
                     if(_udpDataLen > 0)
                     {
                         if((_udpDataLen >=1000)&&(_udpDataLen <2048))
                         {
                             SendCharToESP(_udpDataLen/1000 + 48);
                             SendCharToESP((_udpDataLen%1000)/100 + 48);
                             SendCharToESP((_udpDataLen%100)/10 + 48);
                             SendCharToESP(_udpDataLen%10 + 48);
                         }
                         else if(_udpDataLen >=100)
                         {
                             SendCharToESP(_udpDataLen/100 + 48);
                             SendCharToESP((_udpDataLen%100)/10 + 48);
                             SendCharToESP(_udpDataLen%10 + 48);
                         }
                         else if(_udpDataLen >=10)
                         {
                             SendCharToESP(_udpDataLen/10 + 48);
                             SendCharToESP(_udpDataLen%10 + 48);
                         }
                         else // < 10
                         {
                             SendCharToESP(_udpDataLen%10 + 48);
                         }

