turjasuzworld/publib/TW_ESP8266_v3.c
                     }
                     else //  for TCP
                     {
                         if(strlen((const char*)_getUrlPtr) >=100)
                         {
                             SendCharToESP(strlen((const char*)_getUrlPtr)/100 + 48);
                             SendCharToESP((strlen((const char*)_getUrlPtr)%100)/10 + 48);
                             SendCharToESP(strlen((const char*)_getUrlPtr)%10 + 48);
                         }
                         else if(strlen((const char*)_getUrlPtr) >=10)
                         {
                             SendCharToESP(strlen((const char*)_getUrlPtr)/10 + 48);
                             SendCharToESP(strlen((const char*)_getUrlPtr)%10 + 48);
                         }
                         else
                         {
                             SendCharToESP(strlen((const char*)_getUrlPtr)%10 + 48);
                         }
                     }
                     SendDataToESP("\r\n");
                     res = NULL;
                     res = mdmReplySearch((const char *)_MdmBuffer, ">");
                     if(*res=='>')
                     {
                         RetSts = _E8266_CIPSEND_ARROW_SUCCESS;
                     }
                     else
                     {
                         // HANDLING TO BE DONE HERE
                     }


                     RetryTimeout1--;

                 } while((RetSts != _E8266_CIPSEND_ARROW_SUCCESS)&&(RetryTimeout1>0));

                 if (RetryTimeout1 == 0)
                 {
                     RetSts = _E8266_CIPSEND_ARROW_TIMEOUT;// => CONTINUE FROM HERE
                 }

                 //////////////// Next send the GET Request in HTTP1.1 format without Secured channel/////
                 if(RetSts == _E8266_CIPSEND_ARROW_SUCCESS)
                 {
                     RetryTimeout1 = 1; // Keep retry of sending the string to only once as under one connection attempt, sending
                                         // The api request or data twice is of no use
                         do
                         {
                             if(_udpDataLen > 0)
                             {
                                 for (udpDataCtr = 0; udpDataCtr < _udpDataLen; ++udpDataCtr)
                                 {
                                     SendCharToESP(_getUrlPtr[udpDataCtr]);
                                 }

                             }
                             else
                             {
                                  SendDataToESP((const char*)_getUrlPtr); // GET request sent to Server
                             }
                                     RetryTimeout5 = 0;
                                     do
                                     {
                                         RetryTimeout5++;
                                         _delay_cycles(SystemFreq*2);//Adjust this as per network latency

                                     } while((_MdmBuffCnt == 0)&&(RetryTimeout5 < 3));



                                     RetryTimeout2 = 20;
                                     do
                                     {
                                         _delay_cycles(SystemFreq);
                                         if(_udpDataLen > 0)
                                         {
                                          res = NULL;
                                          res = strstr((const char *)_MdmBuffer,"SEND OK");//OK was changed to CLOSED on 2 May 2020
                                          _delay_cycles(SystemFreq/5);
                                          if(*res == 'S') //O was changed to CLOSED on 2 May 2020
                                          {

                                              break;
                                          }
                                         }

                                         res = NULL;
                                         res = strstr((const char *)_MdmBuffer,"CLOSED");//OK was changed to CLOSED on 2 May 2020
                                         _delay_cycles(SystemFreq/5);
                                         if(*res == 'C') //O was changed to CLOSED on 2 May 2020
                                         {

                                             break;
                                         }
                                         res = NULL;
                                         res = strstr((const char *)_MdmBuffer,"FAIL");
                                         _delay_cycles(SystemFreq/5);
                                         if(*res == 'F')
                                         {

                                             break;
                                         }

                                         RetryTimeout2--;
                                     } while ((res == NULL)&&(RetryTimeout2>0)); // Blocking Call

                                     if(res != NULL)
                                     {

                                             if((*res=='C')||(*res=='S')) //O was changed to CLOSED on 2 May 2020
                                             {
                                                 RetSts = _E8266_SEND_OK_RECVD;
                                             }
                                             else if(*res=='F')
                                             {
                                                 // HANDLING TO BE DONE HERE
                                                 RetSts = _E8266_SEND_FAIL;
                                             }
                                     }
                                     else if(RetryTimeout2 == 0)
                                     {
                                         RetSts = _E8266_SEND_TIMEOUT;// => CONTINUE FROM HERE
                                     }
//                                     else
//                                     {
//                                         RetSts = _E8266_SM_CMD_ERROR;
//                                     }

                                     RetryTimeout1--;
                         } while((RetSts != _E8266_SEND_OK_RECVD)&&(RetryTimeout1>0));

