turjasuzworld/publib/TW_ESP8266_v3.c
                 }
                 else
                 {
                     //RetSts != _E8266_CIPSEND_ARROW_SUCCESS
                 }
                 ////////// GET handling completed //////////////////////////////////////

                             if((RetSts == _E8266_SEND_OK_RECVD)&&(_udpServPort == _E8266_NON_UDP_MODE))
                             {

//                                         runHomeDisplay(_UpdateRxDataTransaction); // Indicate on HMI that data has been received from server

                                         /*
                                          * Fetch the GET DATA into RAM
                                          */

                                             temp_mdm = strchr((const char*)_MdmBuffer, '{'); //char *strchr(const char *str, int c) searches for the first
                                                                                         //occurrence of the character c (an unsigned char) in the
                                                                                         //string pointed to by the argument str //
                                             temp_mdm+= 2;                        // To make the pointer parse the Battery % val and also the mV val.

                                             while(*temp_mdm != '}')
                                             {

                                                 _MdmHTTPBuff[Charcount]= *temp_mdm;
                                                 temp_mdm++;
                                                 Charcount++;
                                             }

                                             //void (*ptr)() = &ParseMdmBuffer; // Callback to ParseMdmBuffer is disabled due to suspected stack crash.

                                             //ParseCallback(ptr);
                                             //ParseMdmBuffer();
                             }
                             else
                             {
                                //if  RetSts != _E8266_SEND_OK_RECVD
                             }

            }
            else
            {
                //if RetSts != _E8266_CIPSTART_OK
            }

//            runHomeDisplay(_UpdateIoTRxTxDataTransaction);

            break;

        case _Esp_GET_Request:
            SendDataToUCA3("__case _Esp_GET_Request in MdmMakeReady__\r");

            ///// Fetch the IP using IPFSR//////////
            RetSts = currState;
            if((RetSts == _E8266_WIFI_RCV_IP_SUCCESS)||(RetSts == _E8266_PING_SUCCESS)||(RetSts == _E8266_SEND_OK_RECVD))
            {


                /////////// Next Send the GET request to the server = CONNECT TO SERVER ///////////

                    RetryTimeout1 = 2;
                    do
                    {
                        SendDataToESP("AT+CIPSTART=\"TCP\",\""); // station mode set
                        SendDataToESP(_servUrlPtr);
                        SendDataToESP("\",80\r\n");
                        _delay_cycles(SystemFreq*3);
                        // Wait till modem output is silent !/////////
                        RetryTimeout5 = 0;
                        do
                        {
                            RetryTimeout5++;
                            _delay_cycles(SystemFreq*2);//Adjust this as per network latency

                        } while((_MdmBuffCnt == 0)&&(RetryTimeout5 < 3));
                        if(RetryTimeout5 == 3)
                        {
                            return _E8266_CIPSTART_TIMEOUT;
                        }
                        //////////////////////////////////////////////
                        RetryTimeout2 = 10;
                        do
                        {
                            // Check for CONNECT
                            res = NULL;
                            res = strstr((const char *)_MdmBuffer,"DNS Fail");
                            _delay_cycles(SystemFreq/5);
                            if(*res == 'D')
                            {
                                break;
                            }
                            // Check for CONNECT
                            res = NULL;
                            res = strstr((const char *)_MdmBuffer,"CONNECT");
                            _delay_cycles(SystemFreq/5);
                            if(*res == 'C')
                            {
                                break;
                            }
                            //Check for ALREADY CONNECTED
                            res = NULL;
                            res = strstr((const char *)_MdmBuffer,"ALREADY");
                            _delay_cycles(SystemFreq/5);
                            if(*res == 'A')
                            {
                                break;
                            }
                            // Second Check for ERROR
                            res = NULL;
                            res = strstr((const char *)_MdmBuffer,"FAIL");
                            _delay_cycles(SystemFreq/5);
                            if(*res == 'F')
                            {
                                break;
                            }
                            // Second Check for ERROR
                            res = NULL;
                            res = strstr((const char *)_MdmBuffer,"CLOSED");
                            _delay_cycles(SystemFreq/5);
                            if(*res == 'C')
                            {
                                break;
                            }

                            RetryTimeout2--;
                        } while ((res == NULL)&&(RetryTimeout2>0));
                        //res += 1;   // Since CLOSED and CLOSE starts with C, so we check with O and L and A for FAIL
                        if((*res=='D')&&(*(res+1)=='N'))
                        {
                            RetSts = _E8266_CIPSTART_DNS_ERROR;//
                        }
                        else if((*res=='C')&&(*(res+1)=='O'))
                        {
                            RetSts = _E8266_CIPSTART_OK;//CONNECT CONDITION
                        }
                        else if((*res=='F')&&(*(res+1)=='A'))
                        {
                            RetSts = _E8266_CIPSTART_ERROR;// For FAIL
                        }
                        else if((*res=='A')&&(*(res+1)=='L'))
                        {
                            RetSts = _E8266_CIPSTART_ALREADY_CONNCTD;//For ALREADY CONNECTED
                        }
                        else if((*res=='C')&&(*(res+1)=='L'))
                        {
                            // NO HANDLING DONE FOR CLOSED RetSts = _E8266_CIPSTART_ALREADY_CONNCTD;//For ALREADY CONNECTED
                        }
                        else
                        {
                            // no handling for OTHER USE CASES
                        }

                        RetryTimeout1--;

                    } while((RetSts != _E8266_CIPSTART_OK)&&(RetryTimeout1>0));

                    if (RetryTimeout1 == 0)
                    {
                        RetSts = _E8266_CIPSTART_TIMEOUT;
                    }

