turjasuzworld/publib/TW_ESP8266_v3.c
            }
            else
            {
                //RetSts = _E8266_SM_CMD_ERROR;
            }

            break;
////////////////////////////////////////////////////

        case _Esp_UDP_GET_Request:
            SendDataToUCA3("__case _Esp_UDP_GET_Request in MdmMakeReady__\r");
            ///// Fetch the IP using IPFSR//////////
            RetSts = currState;
            if((RetSts == _E8266_WIFI_RCV_IP_SUCCESS)||(RetSts == _E8266_PING_SUCCESS)||(RetSts == _E8266_SEND_OK_RECVD))
            {
                /////////// Next Send the GET request to the server = CONNECT TO SERVER ///////////

                RetryTimeout1 = 2;
                do
                {
                    /*
                     * AT+CIPSTART=<type>,<remoteIP>,       <remote port>[,(<UDPlocalport>),(<UDPmode>)]
                     * AT+CIPSTART="UDP","192.168.101.110",1000,                1002,           2
                     */
                    SendDataToESP("AT+CIPSTART=\"UDP\",\""); // station mode set
                    SendDataToESP(_udpServUrlPtr);
                    SendDataToESP("\",");
                    if(_udpServPort >=1000)
                    {
                        SendCharToESP(_udpServPort/1000 + 48);
                        SendCharToESP((_udpServPort%1000)/100 + 48);
                        SendCharToESP((_udpServPort%100)/10 + 48);
                        SendCharToESP(_udpServPort%10 + 48);
                    }
                    else if(_udpServPort >=100)
                    {
                        SendCharToESP(_udpServPort/100 + 48);
                        SendCharToESP((_udpServPort%100)/10 + 48);
                        SendCharToESP(_udpServPort%10 + 48);
                    }
                    else if(strlen((const char*)_udpServPort) >=10)
                    {
                        SendCharToESP(_udpServPort/10 + 48);
                        SendCharToESP(_udpServPort%10 + 48);
                    }
                    else
                    {
                        SendCharToESP(_udpServPort%10 + 48);
                    }
                    SendDataToESP("\r\n");
//                    SendDataToESP(",");
//                    SendDataToESP(_udpServPort); // Enable if local port != remote port
//                    SendDataToESP("\r\n");
                    _delay_cycles(SystemFreq*3);
                    //                        res = NULL;
                    //                        do
                    //                        {
                    //                            res = strstr((const char *)_MdmBuffer,"CONNECT");
                    //                        } while (res == NULL); // Blocking Call



                    RetryTimeout2 = 5;
                    do
                    {
                        // Check for CONNECT
                        res = NULL;
                        res = strstr((const char *)_MdmBuffer,"CONNECT");
                        _delay_cycles(SystemFreq/5);
                        if(*res == 'C')
                        {
                            break;
                        }
                        //Check for ALREADY CONNECTED
                        res = NULL;
                        res = strstr((const char *)_MdmBuffer,"ALREADY");
                        _delay_cycles(SystemFreq/5);
                        if(*res == 'A')
                        {
                            break;
                        }
                        // Second Check for ERROR
                        res = NULL;
                        res = strstr((const char *)_MdmBuffer,"FAIL");
                        _delay_cycles(SystemFreq/5);
                        if(*res == 'F')
                        {
                            break;
                        }
                        // Second Check for ERROR
                        res = NULL;
                        res = strstr((const char *)_MdmBuffer,"CLOSED");
                        _delay_cycles(SystemFreq/5);
                        if(*res == 'C')
                        {
                            break;
                        }

                        RetryTimeout2--;
                    } while ((res == NULL)&&(RetryTimeout2>0));
                    res += 1;   // Since CLOSED and CLOSE starts with C, so we check with O and L and A for FAIL
                    if(*res=='O')
                    {
                        RetSts = _E8266_CIPSTART_UDP_OK;
                    }
                    else if(*res=='A')
                    {
                        RetSts = _E8266_CIPSTART_ERROR;// For FAIL
                    }
                    else if(*res=='L')
                    {
                        RetSts = _E8266_CIPSTART_ALREADY_CONNCTD;//For ALREADY CONNECTED
                    }
                    else
                    {
                        // no handling for CLOSED, may add later
                    }

                    RetryTimeout1--;

                } while((RetSts != _E8266_CIPSTART_UDP_OK)&&(RetryTimeout1>0));

                if (RetryTimeout1 == 0)
                {
                    RetSts = _E8266_CIPSTART_TIMEOUT;
                }

            }
            else
            {
                //RetSts = _E8266_SM_CMD_ERROR;
            }

            break;






////////////////////////////////////////////////////
        case _Esp_SET_Request:


            SendDataToUCA3("__case _Esp_SET_Request in MdmMakeReady__\r");
            RetSts = currState;
            if((RetSts == _E8266_CIPSTART_OK)||(RetSts == _E8266_SEND_OK_RECVD)||(RetSts == _E8266_SEND_TIMEOUT))
            {
                 RetryTimeout1 = 5;
                 do
                 {
                     SendDataToESP("AT+CIPSEND="); // station mode set
                     if(strlen((const char*)_setUrlPtr) >=100)
                     {
                         SendCharToESP(strlen((const char*)_setUrlPtr)/100 + 48);
                         SendCharToESP((strlen((const char*)_setUrlPtr)%100)/10 + 48);
                         SendCharToESP(strlen((const char*)_setUrlPtr)%10 + 48);
                     }
                     else if(strlen((const char*)_setUrlPtr) >=10)
                     {
                         SendCharToESP(strlen((const char*)_setUrlPtr)/10 + 48);
                         SendCharToESP(strlen((const char*)_setUrlPtr)%10 + 48);
                     }
                     else
                     {
                         SendCharToESP(strlen((const char*)_setUrlPtr)%10 + 48);
                     }
                     SendDataToESP("\r\n");
                     res = NULL;
                     res = mdmReplySearch((const char *)_MdmBuffer, ">");
                     if(*res=='>')
                     {
                         RetSts = _E8266_CIPSEND_ARROW_SUCCESS;
                     }
                     else
                     {
                         // HANDLING TO BE DONE HERE
                     }


                     RetryTimeout1--;

