turjasuzworld/publib/TW_ESP8266_v3.c
                 } while((RetSts != _E8266_CIPSEND_ARROW_SUCCESS)&&(RetryTimeout1>0));

                 if (RetryTimeout1 == 0)
                 {
                     RetSts = _E8266_CIPSEND_ARROW_TIMEOUT;// => CONTINUE FROM HERE
                 }

                 //////////////// Next send the GET Request in HTTP1.1 format without Secured channel/////
                 if(RetSts == _E8266_CIPSEND_ARROW_SUCCESS)
                 {
                     RetryTimeout1 = 2;
                         do
                         {
                                     SendDataToESP(_setUrlPtr);
                                     //SendDataToESP(_MdmConstructedSetUrl); // GET request sent to Server
                                     while(_MdmBuffCnt == 0);
                                     _delay_cycles(SystemFreq);//SystemFreq/2
//                                     SendDataToESP("AT+CIPCLOSE\r\n"); // Close the Connection and wait for SEND OK
//                                     _delay_cycles(SystemFreq);


                                     RetryTimeout2 = 20;
                                     do
                                     {
                                         res = NULL;
                                         res = strstr((const char *)_MdmBuffer,"CLOSED");//OK was changed to CLOSED on 2 May 2020
                                         _delay_cycles(SystemFreq/5);
                                         if(*res == 'C') //O was changed to CLOSED on 2 May 2020
                                         {

                                             break;
                                         }
                                         res = NULL;
                                         res = strstr((const char *)_MdmBuffer,"FAIL");
                                         _delay_cycles(SystemFreq/5);
                                         if(*res == 'F')
                                         {

                                             break;
                                         }

                                         RetryTimeout2--;
                                     } while ((res == NULL)&&(RetryTimeout2>0)); // Blocking Call

                                     if(res != NULL)
                                     {

                                             if(*res=='C') //O was changed to CLOSED on 2 May 2020
                                             {
                                                 RetSts = _E8266_SEND_OK_RECVD;
                                             }
                                             else if(*res=='F')
                                             {
                                                 // HANDLING TO BE DONE HERE
                                                 RetSts = _E8266_SEND_FAIL;
                                             }
                                     }
                                     else if(RetryTimeout2 == 0)
                                     {
                                         RetSts = _E8266_SEND_TIMEOUT;// => CONTINUE FROM HERE
                                     }
                                     else
                                     {
                                         RetSts = _E8266_SM_CMD_ERROR;
                                     }

                                     RetryTimeout1--;
                         } while((RetSts != _E8266_SEND_OK_RECVD)&&(RetryTimeout1>0));

                 }
                 else
                 {
                     //RetSts != _E8266_CIPSEND_ARROW_SUCCESS
                 }
                 ////////// GET handling completed //////////////////////////////////////

                             if(RetSts == _E8266_SEND_OK_RECVD)
                             {


                             }
                             else
                             {
                                //if  RetSts != _E8266_SEND_OK_RECVD
                             }

            }
            else
            {
                //if RetSts != _E8266_CIPSTART_OK
            }

//            runHomeDisplay(_UpdateIoTRxTxDataTransaction);

            break;
//////////////////////
        case _Esp_UDP_Close_Request:
            RetSts = currState;
            if((RetSts == _E8266_SEND_OK_RECVD)||
                    (RetSts == _E8266_CIPCLOSE_UDP)||
                    (RetSts == _E8266_CIPSTART_DNS_ERROR)||
                    (RetSts == _E8266_CIPSTART_ERROR)||
                    (RetSts == _E8266_CIPSTART_TIMEOUT))
            {
                RetryTimeout1 = 5;
                do
                {
                    SendDataToESP("AT+CIPCLOSE\r\n"); // station mode set
                    res = NULL;
                    res = mdmReplySearch((const char *)_MdmBuffer, "CLOSED");
                    if(*res=='C')
                    {
                        RetSts = _E8266_CIPCLOSE_UDP_SUCCESS;
                    }
                    else
                    {
                        //TODO: HANDLING TO BE DONE HERE IF NEEDED
                    }


                    RetryTimeout1--;

                } while((RetSts != _E8266_CIPCLOSE_UDP_SUCCESS)&&(RetryTimeout1>0));
                if (RetryTimeout1 == 0)
                {
                    RetSts = _E8266_CIPCLOSE_UDP_FAIL;
                }

            }
            break;
//////////////////////
        default:
            break;
    }



    SendDataToUCA3("State machine ->> __RetSts: ");
    SendCharToUCA3(RetSts/10 + 48);
    SendCharToUCA3(RetSts%10 + 48);
    SendDataToUCA3("\r\n");
    return RetSts;
}

char*               mdmReplySearch(const char* _buff, const char* compStr)
{
    char* temp_res=NULL;
    int   timeout = 10;
    while((_MdmBuffCnt == 0)&&(timeout>0))
    {
        _delay_cycles(SystemFreq);
        timeout--;
    }
    if(timeout==0) return "Timeout";
    _delay_cycles(SystemFreq);
    temp_res = strstr(_buff, compStr);//strstr(, )
    return temp_res;

