turjasuzworld/publib/TW_ESP8266_v3.c
}

/* NOT FOR UDP MODE !!!!
 * Complete tested routine to manage
 * connection, reconnection and server GET/SET access flow
 */
esp8266StateMachines    _provision_Connect_GETcall_ESP(esp8266StateMachines _state, bool getChkNeeded, char* _GET_URL, char* _SERVER_URL)
{
    volatile  esp8266StateMachines k = _state;
    static int _espPwrOnRetryTimeout=0;
//    k=_E8266_PWR_UP;

    if((k == _E8266_PWR_UP)||
            (k == _E8266_SEND_OK_RECVD)||
            (k == _E8266_PING_SUCCESS)||
            (k == _E8266_CIPSTART_OK)||
            (k == _E8266_CIPSEND_ARROW_TIMEOUT)||
            (k == _E8266_CIPSTART_TIMEOUT)||
            (k == _E8266_SEND_FAIL)||
            (k == _E8266_SEND_TIMEOUT)||
            (k == _E8266_SM_CMD_ERROR))
    {
                if((k == _E8266_PWR_UP)||
                        (k == _E8266_CIPSEND_ARROW_TIMEOUT)||
                        (k == _E8266_CIPSTART_TIMEOUT)||
                        (k == _E8266_SEND_TIMEOUT)||
                        (k == _E8266_SEND_FAIL))
                {
                        _espPwrOnRetryTimeout=0;
                        while((k != _E8266_PWR_UP_SUCCESS)&&(_espPwrOnRetryTimeout<5))
                        {
                            if((k == _E8266_PWR_UP)||
                                    (k == _E8266_PWR_UP_FAILURE)||
                                    (k == _E8266_CIPSEND_ARROW_TIMEOUT)||
                                    (k == _E8266_CIPSTART_TIMEOUT)||
                                    (k == _E8266_SEND_TIMEOUT)||
                                    (k == _E8266_SEND_FAIL))
                                {
                                    disESP8266();
                                    _delay_cycles(SystemFreq);
                                    enESP8266();
                                }
                            if(k == _E8266_PWR_UP)
                                {
                                    k = MdmMakeReady(_Esp_Full_Init, k,NULL,NULL,NULL,NULL,_E8266_NON_UDP_MODE,0);
                                }
                            else
                                {
                                    k = MdmMakeReady(_Esp_Full_Init, _E8266_PWR_UP,NULL,NULL,NULL,NULL,_E8266_NON_UDP_MODE,0);// IGNORING REST USE CASES OF k AS OF NOW
                                }
                            _espPwrOnRetryTimeout++;
                        }

                        if(_espPwrOnRetryTimeout == 5)
                        {
                              if(k == _E8266_PWR_UP_FAILURE)  k = MdmMakeReady(_Esp_Full_Init, _E8266_PWR_DN,NULL,NULL,NULL,NULL,_E8266_NON_UDP_MODE,0);
                              return k; // any unwanted states will be returned and server conn will be aborted!
                        }




                        //// ESP can't reach below location unless
                        //// _E8266_PWR_UP_SUCCESS is received
                        k = MdmMakeReady(_Esp_Connect_WIFI, k,NULL,NULL,NULL,NULL,_E8266_NON_UDP_MODE,0);
                        if((k == _E8266_PING_FAIL)||(k == _E8266_CWJAP_AP_NT_FND_3)||(k == _E8266_CWJAP_WRNG_PSWRD_2))
                        {
                            return k; // any unwanted states will be returned and server conn will be aborted!
                        }
                }
        /*
         *  This part is only required if
         *  there is GET response needed
         */
        if(getChkNeeded)
        {
            k = MdmMakeReady(_Esp_GET_Request, k,_GET_URL,(char*)_SERVER_URL,NULL,NULL,_E8266_NON_UDP_MODE,0);
            if(k == ((_E8266_CIPSTART_DNS_ERROR)||(_E8266_CIPSTART_ERROR)||(_E8266_CIPSTART_TIMEOUT)))
            {
                k=MdmMakeReady(_Esp_UDP_Close_Request, k, NULL, NULL, NULL, NULL, _E8266_NON_UDP_MODE, 0);

            }
            else
            {
                k = MdmMakeReady(_Esp__repeated_send_Request, k,_GET_URL,(char*)_SERVER_URL,NULL,NULL,_E8266_NON_UDP_MODE,0);
            }
            _delay_cycles(SystemFreq*5);
        }
        else
        {

        }

    }
    return k; // should return _E8266_PING_SUCCESS (if getChkNeeded == false) or _E8266_SEND_OK_RECVD (if getChkNeeded == true)
}





/*
 * callback function to parse data received in UCAx Buffer
 */
void ParseCallback(void (*ptr)())
{
    (*ptr) (); // callback to A
}
///////////////////////////////////////////////////////////////////////////////////////////////////////////
/*
 *    Interrupt Vectors for the data acquired from modem
 */

#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector=USCI_A0_VECTOR
__interrupt void USCI_A0_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCI_A0_VECTOR))) USCI_A0_ISR (void)
#else
#error Compiler not supported!
#endif
{
  switch(__even_in_range(UCA0IV,4))
  {
  case 0:

    break;                             // Vector 0 - no interrupt log_data

  case 2:                                   // Vector 2 - RXIFG
      _MdmBuffer[_MdmBuffCnt] = UCA0RXBUF;                  // TX -> RXed character
      SendCharToUCA3(_MdmBuffer[_MdmBuffCnt]);              // comment if usb terminal logging is not needed
      _MdmBuffCnt++;
      _bytesDataTransacted++;
      if(_MdmBuffCnt==1024) _MdmBuffCnt=0; // Added on 2 May 2020
    break;

  case 4:

    break;                             // Vector 4 - TXIFG

  default:

    break;
  }

  __bic_SR_register_on_exit(LPM0_bits);     // exit power save mode if super loop is required in main
}
